mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
//     if (phase != -1) {
//         init->CLKPhase = phase == 0 ? SPI_PHASE_1EDGE : SPI_PHASE_2EDGE;
//     }

//     if (bits != -1) {
//         init->DataSize = (bits == 16) ? SPI_DATASIZE_16BIT : SPI_DATASIZE_8BIT;
//     }

//     if (firstbit != -1) {
//         init->FirstBit = firstbit;
//     }
// }

// TODO allow to take a list of pins to use
void spi_init(const mp_obj_t *self_in) {
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*) self_in;
    const pin_obj_t *pins[4] = { NULL, NULL, NULL, NULL };

    if (0) {
    #if defined(MICROPY_HW_SPI0_SCK)
    } else if (self->spi_id == PYB_SPI_0) {
        self->spi_base = SSI0_BASE;
        self->periph = SYSCTL_PERIPH_SSI0;
        self->regs = (periph_spi_t*)SSI0_BASE;
        self->irqn = INT_SSI0;
        pins[0] = MICROPY_HW_SPI0_SCK;
        #if defined(MICROPY_HW_SPI0_MISO)
        pins[1] = MICROPY_HW_SPI0_MISO;
        #endif
        #if defined(MICROPY_HW_SPI0_MOSI)
        pins[2] = MICROPY_HW_SPI0_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI0_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI0_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI1_SCK)
    } else if (self->spi_id == PYB_SPI_1) {
        self->spi_base = SSI1_BASE;
        self->periph = SYSCTL_PERIPH_SSI1;
        self->regs = (periph_spi_t*)SSI1_BASE;
        self->irqn = INT_SSI1;
        pins[0] = MICROPY_HW_SPI1_SCK;
        #if defined(MICROPY_HW_SPI1_MISO)
        pins[1] = MICROPY_HW_SPI1_MISO;
        #endif
        #if defined(MICROPY_HW_SPI1_MOSI)
        pins[2] = MICROPY_HW_SPI1_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI1_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI1_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    } else if (self->spi_id == PYB_SPI_2) {
        self->spi_base = SSI2_BASE;
        self->periph = SYSCTL_PERIPH_SSI2;
        self->regs = (periph_spi_t*)SSI2_BASE;
        self->irqn = INT_SSI2;
        pins[0] = MICROPY_HW_SPI2_SCK;
        #if defined(MICROPY_HW_SPI2_MISO)
        pins[1] = MICROPY_HW_SPI2_MISO;
        #endif
        #if defined(MICROPY_HW_SPI2_MOSI)
        pins[2] = MICROPY_HW_SPI2_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI2_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI2_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    } else if (self->spi_id == PYB_SPI_3) {
        self->spi_base = SSI3_BASE;
        self->periph = SYSCTL_PERIPH_SSI3;
        self->regs = (periph_spi_t*)SSI3_BASE;
        self->irqn = INT_SSI3;
        pins[0] = MICROPY_HW_SPI3_SCK;
        #if defined(MICROPY_HW_SPI3_MISO)
        pins[1] = MICROPY_HW_SPI3_MISO;
        #endif
        #if defined(MICROPY_HW_SPI3_MOSI)
        pins[2] = MICROPY_HW_SPI3_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI3_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI3_FSS;
        }
        #endif
    #endif
    } else {
        // SPI does not exist for this board (shouldn't get here, should be checked by caller)
        return;
    }

    // init the GPIO lines
    for (uint i = 0; i < (self->soft_fss ? 3 : 4); i++) {
        if (pins[i] == NULL) {
            continue;
        }
        mp_hal_pin_config_alt(pins[i], PIN_FN_SSI, self->spi_id);
        // idle_high_polarity
        if(i==0 && (self->protocol & 0x1) ) MAP_GPIOPadConfigSet(pins[i]->gpio, pins[i]->pin_mask, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
    }

    // init the SPI device

    SysCtlPeripheralEnable(self->periph);
    while(!SysCtlPeripheralReady(self->periph));
    IntDisable(self->irqn);
    SSIDisable(self->spi_base);
    
    SSIClockSourceSet(self->spi_base, SSI_CLOCK_SYSTEM);
    SSIConfigSetExpClk(self->spi_base, MAP_SysCtlClockGet(), self->protocol, self->mode, self->baudrate, self->bits);
    SSIDMADisable(self->spi_base, SSI_DMA_TX | SSI_DMA_RX);
    SSIDMAEnable(self->spi_base, self->dma_enabled);

    SSIEnable(self->spi_base);
}

void spi_deinit(const machine_hard_spi_obj_t *self) {
    SSIDisable(self->spi_base);
    SysCtlPeripheralDisable(self->periph);
}



/******************************************************************************/
// Implementation of hard SPI for machine module

typedef struct _machine_hard_spi_obj_t {
    mp_obj_base_t base;
    uint32_t spi_base;
    uint32_t periph;
    periph_spi_t* regs;
    uint32_t irqn;
    uint8_t mode : 1;
    uint32_t baudrate;
    uint8_t bits;
    // uint8_t polarity : 1;
    // uint8_t phase : 1;
    uint32_t protocol;
    spi_id_t spi_id : 3;
    bool is_enabled : 1;
    bool soft_fss : 1; // Frame signal generated by hardware, or manually
    uint8_t dma_enabled : 3;
} machine_hard_spi_obj_t;

// Waits at most timeout milliseconds for SSI flag to be set.
// Returns true if flag is/was set, false on timeout.
STATIC bool spi_tx_wait(machine_hard_spi_obj_t *self, uint32_t timeout) {
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (self->regs->SR & SSI_SR_TNF) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

STATIC bool spi_rx_wait(machine_hard_spi_obj_t *self, uint32_t timeout) {
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (self->regs->SR & SSI_SR_RNE) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

STATIC bool spi_wait_flag_unset(machine_hard_spi_obj_t *self, uint32_t flag, uint32_t timeout) {
    // Note: we don't use WFI to idle in this loop because UART tx doesn't generate
    // an interrupt and the flag can be set quickly if the baudrate is large.
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (!(self->regs->SR & flag)) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

mp_uint_t spi_tx_only(machine_hard_spi_obj_t *self, uint16_t* data, size_t len, uint32_t word_timeout, int *errcode) {
    uint start;
    uint num_tx = 0;
    uint32_t dummy;
    while(num_tx < len) {

        if(!spi_tx_wait(self, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_tx;
        }

        SSIDataPutNonBlocking(self->spi_base, data[num_tx]);
        SSIDataGetNonBlocking(self->spi_base, &dummy);
        num_tx++;
    }

    if(!spi_wait_flag_unset(self, SSI_SR_BSY, word_timeout)) {
        *errcode = MP_ETIMEDOUT;
        return num_tx;
    }

