mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
    *errcode = 0;
    return num_tx;
}

mp_uint_t spi_rx_only(machine_hard_spi_obj_t *self, uint16_t* data, size_t len, uint32_t word_timeout, int *errcode) {
    uint start;
    uint num_rx = 0;
    uint32_t dummy = 0;
    while(num_rx < len) {

        if(!spi_rx_wait(self, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_rx;
        }

        SSIDataPutNonBlocking(self->spi_base, dummy);
        num_rx += SSIDataGetNonBlocking(self->spi_base, &data[num_rx]);
    }

    if(!spi_wait_flag_unset(self, SSI_SR_BSY, word_timeout)) {
        *errcode = MP_ETIMEDOUT;
        return num_rx;
    }

    *errcode = 0;
    return num_rx;
}

mp_uint_t spi_rx_tx(machine_hard_spi_obj_t *self, uint16_t* data_rx, uint16_t* data_tx, size_t len, uint32_t word_timeout, int *errcode) {
    uint start;
    uint num_rtx = 0;
    while(num_rtx < len) {

        if(!spi_rx_wait(self, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_rtx;
        }

        if(!spi_tx_wait(self, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_rtx;
        }

        SSIDataPutNonBlocking(self->spi_base, data_tx[num_rtx]);
        SSIDataGetNonBlocking(self->spi_base, &data_rx[num_rtx]);
    }

    if(!spi_wait_flag_unset(self, SSI_SR_BSY, word_timeout)) {
        *errcode = MP_ETIMEDOUT;
        return num_rtx;
    }

    *errcode = 0;
    return num_rtx;
}

// A transfer of "len" bytes should take len*8*1000/baudrate milliseconds.
// To simplify the calculation we assume the baudrate is never less than 8kHz
// and use that value for the baudrate in the formula, plus a small constant.
#define SPI_TRANSFER_TIMEOUT(len) ((len) + 100)

STATIC void spi_transfer(const mp_obj_t *self_in, size_t len, const uint16_t *src, uint16_t *dest, uint32_t timeout) {
    mp_int_t status = 0;
    mp_uint_t bytes_trans = 0;
    machine_hard_spi_obj_t* self = (machine_hard_spi_obj_t*) self_in;
 
    if (dest == NULL) {
        // send only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            bytes_trans = spi_tx_only(self, src, len, timeout, &status);
        } else {
            // TODO
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            bytes_trans = spi_rx_only(self, dest, len, timeout, &status);
        } else {
            // TODO
        }
    } else {
        // send and receive
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            bytes_trans = spi_rx_tx(self, src, dest, len, timeout, &status);
        } else {
            // TODO
        }
    }

    if (status != 0) {
        mp_hal_raise(status);
    }
}

STATIC void machine_hard_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_hard_spi_obj_t *spi;

    mp_printf(print, "SPI(%u", spi->spi_id);
    
    if(spi->mode == SSI_MODE_MASTER) {
        mp_printf(print, ", SPI.MASTER");
            
        mp_printf(print, ", baudrate=%u", spi->baudrate);
            
    } else if(spi->mode == SSI_MODE_SLAVE){
        mp_printf(print, ", SPI.SLAVE");
    } else if(spi->mode == SSI_MODE_SLAVE_OD) {
        mp_printf(print, ", SPI.SLAVE_OD");
    }
    
    mp_printf(print, ", protocol=");
    if(spi->protocol == SSI_FRF_MOTO_MODE_0) mp_printf(print, "SPI0");
    else if(spi->protocol == SSI_FRF_MOTO_MODE_1) mp_printf(print, "SPI1");
    else if(spi->protocol == SSI_FRF_MOTO_MODE_2) mp_printf(print, "SPI2");
    else if(spi->protocol == SSI_FRF_MOTO_MODE_3) mp_printf(print, "SPI3");
    else if(spi->protocol == SSI_FRF_TI) mp_printf(print, "TI");
    else if(spi->protocol == SSI_FRF_NMW) mp_printf(print, "MICROWIRE");
    mp_printf(print, ", bits=%u)", spi->bits);
}

STATIC mp_obj_t machine_hard_spi_init_helper(machine_hard_spi_obj_t* self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_id, ARG_baudrate,/* ARG_prescaler, ARG_polarity, ARG_phase,*/ ARG_bits, ARG_fss, ARG_protocol, ARG_dma, ARG_firstbit, ARG_sck, ARG_mosi, ARG_miso };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = SSI_MODE_MASTER} }, // Default as master
        { MP_QSTR_id,       MP_ARG_OBJ, {.u_obj = MP_OBJ_NEW_SMALL_INT(-1)} },
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = 500000} },
        //{ MP_QSTR_prescaler, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0xFF} },       // max prescaler
        // { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} }, // idle low          
        // { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} }, // first clock edge
        //{ MP_QSTR_dir,      MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SSI_CR1_DIR} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 8} }, 
        { MP_QSTR_fss,   MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}}, // chip select mode (software or hardware)
        { MP_QSTR_protocol,      MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SSI_FRF_MOTO_MODE_0} }, // SSI in SPI mode
        { MP_QSTR_dma,      MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_int = 0}}, // no dma
        //{ MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SPI_FIRSTBIT_MSB} },
        //{ MP_QSTR_ti,       MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        //{ MP_QSTR_crc,      MP_ARG_KW_ONLY | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
        //{ MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        //{ MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        //{ MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_hard_spi_obj_t *self = self_in;    

    // here we would check the sck/mosi/miso pins and configure them, but it's not implemented
    if (args[ARG_sck].u_obj != MP_OBJ_NULL
        || args[ARG_mosi].u_obj != MP_OBJ_NULL
        || args[ARG_miso].u_obj != MP_OBJ_NULL) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError,"explicit choice of sck/mosi/miso is not implemented"));
    }

