mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
    // set the SPI configuration values
    if(args[ARG_mode].u_int > 2) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "Mode accepts only MASTER or SLAVE"));
    }
    self->mode = args[ARG_mode].u_int;

    if(args[ARG_bits].u_int >= 16 || args[ARG_bits].u_int <= 4) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "invalid word length, only values 4..16 are available"));
    }
    self->bits = args[ARG_bits].u_int;

    // if(args[ARG_prescaler].u_int & 0xFFFFFF00) {
    //     nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "prescaler only 2-254!"));
    // }
    // uint8_t prescale = args[ARG_prescaler].u_int;

    if(self->mode) {
        if(args[ARG_baudrate].u_int >= 25000000) {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "baudrate too high, max 25 Mbaud as master"));
        }
    } else {
        if(args[ARG_baudrate].u_int >= 6666666) {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "baudrate too high, max 6.66 mBaud as slave"));
        }
    }
    self->baudrate = args[ARG_baudrate].u_int;

    if(!(args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_0 || args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_1  ||
         args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_2 || args[ARG_protocol].u_int == SSI_FRF_MOTO_MODE_3  ||
         args[ARG_protocol].u_int == SSI_FRF_TI || args[ARG_protocol].u_int == SSI_FRF_NMW)) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "protocol not supported, please use SPI0..3, TI or MICROWIRE!"));
    }
    self->protocol = args[ARG_fss].u_int;

    if(args[ARG_fss].u_int != 0 || args[ARG_fss].u_int != 1) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "fss only accepts CS_HARD(0) or CS_SOFT(1)"));
    }
    // Automatic or Manually assert chipselect? Only applicable in SPI mode
    if(self->protocol == SSI_CR0_FRF_MOTO) {
        self->soft_fss = args[ARG_fss].u_bool;
    } else {
        self->soft_fss = false;
    }

    if(!(args[ARG_dma].u_int & 0x03)) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_raise_ValueError, "dma accepts only DMA_NONE(0), DMA_RX(1), DMA_TX(2) or DMA_BOTH(3)"));
    }
    self->dma_enabled = args[ARG_dma].u_int;
    
    // init the SPI bus
    spi_init(self);

    return mp_const_none;
}

STATIC void machine_hard_spi_init(mp_obj_base_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_hard_spi_init_helper(self_in, n_args, pos_args, kw_args);
}

mp_obj_t machine_hard_spi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    

    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // find SPI port
    spi_id_t spi_id = spi_find(all_args[0]);

    // create dynamic peripheral object
    machine_hard_spi_obj_t *self;

    // get SPI object
    if (MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] == NULL) {
        // create new SSI object
        self = m_new0(machine_hard_spi_obj_t, 1);
        self->base.type = &machine_hard_spi_type;
        self->spi_id = spi_id;
        MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] = self;
    } else {
        // reference existing SSI object
        self = MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1];
    }

    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
        machine_hard_spi_init_helper(self, n_args - 1, all_args + 1, &kw_args);
    }

    return MP_OBJ_FROM_PTR(self);
}

STATIC void machine_hard_spi_deinit(mp_obj_base_t *self_in) {
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_deinit(self);
}

// STATIC mp_uint_t machine_hard_spi_transmit(const machine_hard_spi_obj_t *self, size_t len, const uint8_t *src, uint32_t timeout) {
    
// }

STATIC void machine_hard_spi_transfer(mp_obj_base_t *self_in, size_t len, const uint16_t *src, uint16_t *dest) {
    // machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_transfer(self_in, len, src, dest, SPI_TRANSFER_TIMEOUT(len));
}

STATIC const mp_rom_map_elem_t machine_hard_spi_locals_dict_table[] = {
    // instance methods
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_spi_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_spi_deinit_obj) },

    // { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&mp_machine_spi_read_obj) },
    // { MP_ROM_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_spi_readinto_obj) },
    // { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_spi_write_obj) },
    // { MP_ROM_QSTR(MP_QSTR_write_readinto), MP_ROM_PTR(&mp_machine_spi_write_readinto_obj) },

    // // legacy methods
    // { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&machine_hard_spi_send_obj) },
    // { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&machine_hard_spi_recv_obj) },
    // { MP_ROM_QSTR(MP_QSTR_send_recv), MP_ROM_PTR(&machine_hard_spi_send_recv_obj) },

    // class constants
    /// \constant MASTER - for initialising the bus to master mode
    /// \constant SLAVE - for initialising the bus to slave mode
    /// \constant MSB - set the first bit to MSB
    /// \constant LSB - set the first bit to LSB
    { MP_ROM_QSTR(MP_QSTR_MASTER), MP_ROM_INT(SSI_MODE_MASTER) },
    { MP_ROM_QSTR(MP_QSTR_SLAVE),  MP_ROM_INT(SSI_MODE_SLAVE) },
    { MP_ROM_QSTR(MP_QSTR_SLAVE_OD),  MP_ROM_INT(SSI_MODE_SLAVE_OD) },
    // { MP_ROM_QSTR(MP_QSTR_MSB),    MP_ROM_INT(SPI_FIRSTBIT_MSB) },
    // { MP_ROM_QSTR(MP_QSTR_LSB),    MP_ROM_INT(SPI_FIRSTBIT_LSB) },
    { MP_ROM_QSTR(MP_QSTR_SPI0),    MP_ROM_INT(SSI_FRF_MOTO_MODE_0)},
    { MP_ROM_QSTR(MP_QSTR_SPI1),    MP_ROM_INT(SSI_FRF_MOTO_MODE_1)},
    { MP_ROM_QSTR(MP_QSTR_SPI2),    MP_ROM_INT(SSI_FRF_MOTO_MODE_2)},
    { MP_ROM_QSTR(MP_QSTR_SPI3),    MP_ROM_INT(SSI_FRF_MOTO_MODE_3)},
    { MP_ROM_QSTR(MP_QSTR_TI),      MP_ROM_INT(SSI_FRF_TI)},
    { MP_ROM_QSTR(MP_QSTR_MICROWIRE),    MP_ROM_INT(SSI_FRF_NMW)},
    { MP_ROM_QSTR(MP_QSTR_FIRST_EDGE),    MP_ROM_INT(0)},
    { MP_ROM_QSTR(MP_QSTR_SECOND_EDGE),    MP_ROM_INT(1)},
    { MP_ROM_QSTR(MP_QSTR_IDLE_LOW),    MP_ROM_INT(0)},
    { MP_ROM_QSTR(MP_QSTR_IDLE_HIGH),    MP_ROM_INT(1)},
    { MP_ROM_QSTR(MP_QSTR_FSS_SOFT),    MP_ROM_INT(true)},
    { MP_ROM_QSTR(MP_QSTR_FSS_HARD),    MP_ROM_INT(false)},
    { MP_ROM_QSTR(MP_QSTR_DMA_NONE),    MP_ROM_INT(0)},
    { MP_ROM_QSTR(MP_QSTR_DMA_RX),    MP_ROM_INT(SSI_DMA_RX)},
    { MP_ROM_QSTR(MP_QSTR_DMA_TX),    MP_ROM_INT(SSI_DMA_TX)},
    { MP_ROM_QSTR(MP_QSTR_DMA_BOTH),    MP_ROM_INT(SSI_DMA_TX | SSI_DMA_RX)},

    /* TODO
    { MP_ROM_QSTR(MP_QSTR_DIRECTION_2LINES             ((uint32_t)0x00000000)
    { MP_ROM_QSTR(MP_QSTR_DIRECTION_2LINES_RXONLY      SPI_CR1_RXONLY
    { MP_ROM_QSTR(MP_QSTR_DIRECTION_1LINE              SPI_CR1_BIDIMODE
    { MP_ROM_QSTR(MP_QSTR_NSS_SOFT                    SPI_CR1_SSM
    { MP_ROM_QSTR(MP_QSTR_NSS_HARD_INPUT              ((uint32_t)0x00000000)
    { MP_ROM_QSTR(MP_QSTR_NSS_HARD_OUTPUT             ((uint32_t)0x00040000)
    */
};

STATIC MP_DEFINE_CONST_DICT(machine_hard_spi_locals_dict, machine_hard_spi_locals_dict_table);

STATIC const mp_machine_spi_p_t machine_hard_spi_p = {
    .init = machine_hard_spi_init,
    .deinit = machine_hard_spi_deinit,
    .transfer = machine_hard_spi_transfer,
};

const mp_obj_type_t machine_hard_spi_type = {
    { &mp_type_type },
    .name = MP_QSTR_SPI,
    .print = machine_hard_spi_print,
    .make_new = mp_machine_spi_make_new, // delegate to master constructor
    .protocol = &machine_hard_spi_p,
    .locals_dict = (mp_obj_t)&machine_hard_spi_locals_dict,
};

// const spi_t *spi_from_mp_obj(mp_obj_t o) {
//     if (MP_OBJ_IS_TYPE(o, &machine_hard_spi_type)) {
//         machine_hard_spi_obj_t *self = o;;
//         return self->spi;
//     } else {
//         mp_raise_TypeError("expecting an SPI object");
//     }
// }
